{
  "Blight in corn Leaf": "Plant resistant hybrids, practice 2–3 year crop rotation, plow under crop residue deeply, apply protective fungicides (e.g., azoxystrobin, pyraclostrobin) at first sign during warm humid weather, avoid excessive nitrogen.",
  "Common Rust in corn Leaf": "Grow rust-resistant or tolerant hybrids, ensure balanced fertilization, plant early to escape peak spore dispersal, apply fungicides (e.g., mancozeb, chlorothalonil) only if severe pressure and yield threat exists.",
  "Corn (maize) healthy": "Continue using resistant hybrids, maintain crop rotation, balanced fertility, timely planting, deep tillage of residue, scout fields regularly during humid periods.",
  "Corn Common Rust": "Plant resistant hybrids, avoid late planting in cool humid areas, ensure potassium fertility, apply preventive fungicides only in high-value seed or sweet corn when rust pustules appear early.",
  "Corn Gray Leaf Spot": "Select resistant/tolerant hybrids, rotate with non-grass crops for 1–2 years, shred and bury residue, reduce surface residue with tillage, apply strobilurin or triazole fungicides when lesions appear before tasseling in high-risk fields.",
  "Corn Healthy": "Use resistant hybrids, practice crop rotation and residue management, maintain proper plant population and fertility, scout regularly, avoid continuous corn if possible.",
  "Corn Northern Leaf Blight": "Plant resistant hybrids (best prevention), rotate crops 1–2 years, bury or remove residue, improve airflow with proper row spacing, apply fungicides (e.g., QoI + triazole mixes) from VT–R2 if disease present and conditions favorable.",
  "Gray Leaf Spot in corn Leaf": "Choose GLS-resistant hybrids, rotate to non-host crops, reduce residue through tillage or cover crops, avoid excessive nitrogen, apply fungicide (azoxystrobin, pyraclostrobin + triazole) preventively in continuous corn with high residue.",
  "corn crop": "Select hybrids with strong disease package, rotate crops, manage residue, balance nutrients (especially N and K), plant at optimal density and timing, scout weekly from V6 onward, use fungicide only when economic threshold and yield potential justify application."
}
