{
  "Bacterial leaf blight in rice leaf": "Use resistant varieties (e.g., IR64, Swarna-Sub1 with Xa genes), avoid excess nitrogen, apply balanced NPK + potash, maintain shallow water level, avoid field flooding, seed treatment with streptocycline + copper oxychloride, spray copper hydroxide 0.2% at booting stage if needed, drain field during strong wind/rain.",
  "Brown spot in rice leaf": "Use clean certified seed, apply balanced fertilizer (especially potassium and zinc), avoid drought stress, seed treatment with mancozeb or carbendazim, grow tolerant varieties (e.g., Sahbhagi Dhan, Swarna), maintain proper water management, burn or incorporate stubble properly.",
  "Leaf smut in rice leaf": "Plant tolerant/resistant varieties (e.g., Pusa Basmati 1121, IR36), apply potash-rich fertilizer, avoid excessive nitrogen, seed treatment with carbendazim or vitavax, foliar spray of propiconazole 0.1% at tillering if smut appears.",
  "Rice Brown_Spot": "Correct nutrient deficiencies (K, Zn, Si), avoid water stress, use resistant varieties, apply silicon fertilizers or potassium chloride, seed treatment with mancozeb, maintain uniform water level, remove and burn infected stubble.",
  "Rice Healthy": "Continue using resistant/tolerant varieties, balanced fertilization (N:P:K 120:60:60 kg/ha + Zn), proper water management (AWD method), clean seed, timely transplanting, regular field scouting, avoid excess nitrogen.",
  "Rice Leaf_Blast": "Grow blast-resistant varieties (e.g., PRR78, IRBL series), avoid high nitrogen, apply silicon and potassium, seed treatment with tricyclazole or pyroquilon, spray tricyclazole 0.06% or isoprothiolane at tillering and booting, maintain shallow water, burn infected straw.",
  "Rice Neck_Blast": "Use highly resistant varieties, avoid late planting and excess nitrogen, apply preventive spray of tricyclazole or azoxystrobin + difenoconazole at 5–10% heading, split nitrogen application, ensure potash sufficiency, remove volunteer plants and infected stubble.",
  "Sogatella rice": "Conserve natural enemies (mirid bugs, spiders), avoid early-season broad-spectrum sprays, use light traps or yellow sticky traps, apply neem oil or buprofezin at nymph stage, seedling root dip with imidacloprid 0.02% in nursery, synchronized planting to reduce migration."
}
