{
  "Soybean bacterial_blight": "Use resistant varieties (e.g., Williams 82, Jack), avoid overhead irrigation, practice crop rotation with non-legumes for 2–3 years, apply copper-based bactericide (copper hydroxide) preventively at V2–V4 stage, remove and destroy infected leaves, avoid working in wet fields.",
  "Soybean caterpillar": "Scout for eggs/larvae weekly from V3 onward, release natural enemies (Trichogramma wasps, ladybugs), apply Bacillus thuringiensis (Bt) or spinosad when thresholds reached (20–30% defoliation pre-bloom), use pheromone traps for monitoring, avoid broad-spectrum insecticides early season.",
  "Soybean diabrotica_speciosa": "Rotate with non-host crops (corn, small grains) for 2 years, use soil insecticides (chlorpyrifos) at planting if history of damage, apply foliar lambda-cyhalothrin or bifenthrin when beetles appear, plant trap crops like corn nearby, monitor with yellow sticky traps.",
  "Soybean downy_mildew": "Plant resistant varieties (e.g., PI 200492), ensure good airflow with wide row spacing (30–38 in), avoid excessive nitrogen, apply metalaxyl or mefenoxam seed treatment, spray mancozeb or chlorothalonil preventively during cool wet conditions from R1–R5.",
  "Soybean healthy": "Continue using resistant/tolerant varieties, balanced fertilization (P and K emphasis), crop rotation every 2–3 years, timely planting, proper seed treatment, regular scouting from emergence to R6, maintain optimal plant population (140,000–160,000/ac), avoid stress factors.",
  "Soybean mosaic_virus": "Use certified virus-free seed only, plant resistant varieties (e.g., Vinton 81, Peking), control aphid vectors with imidacloprid seed treatment or foliar sprays if needed, rogue infected plants early, avoid planting near perennial legumes or infected fields.",
  "Soybean powdery_mildew": "Select resistant cultivars (e.g., PI 200492), ensure morning sun exposure and good airflow, avoid late planting in cool humid areas, apply sulfur or triadimefon preventively from R1 if mildew appears in region, remove volunteer soybeans.",
  "Soybean rust": "Plant rust-resistant varieties (e.g., PI 200492, AG 2431), apply triazole fungicides (tebuconazole, tetraconazole) preventively at R2–R3 if spores detected in sentinel plots, monitor USDA rust tracker, avoid double cropping soybeans, destroy volunteer plants.",
  "Soybean southern_blight": "Rotate with non-host cereals for 3–4 years, deep plow residue, avoid high plant populations, use tolerant varieties, apply pentachloronitrobenzene (PCNB) or azoxystrobin at planting, maintain low soil pH if feasible, solarize soil in small areas."
}
