{
  "Tea algal leaf": "Improve shade and ventilation by proper pruning and plucking, reduce humidity through wider spacing and drainage, apply Bordeaux mixture 1% or copper oxychloride 0.25% twice during monsoon, scrape off algal growth manually on thick stems.",
  "Tea anthracnose": "Regular light pruning and skiffing for open bush architecture, avoid excess shade, spray copper oxychloride 0.25% or carbendazim 0.1% alternately every 15 days during wet weather, remove and burn severely affected shoots.",
  "Tea bird eye spot": "Maintain balanced fertilization (avoid excess nitrogen), regular plucking to remove infected tips, spray copper oxychloride 0.25% or hexaconazole 0.1% at 10–15 day intervals during rainy season, improve drainage and airflow.",
  "Tea brown blight": "Apply potassium-rich fertilizer, prune for better light penetration, spray mancozeb 0.25% or copper oxychloride 0.25% during cool humid periods, remove and burn affected twigs.",
  "Tea healthy": "Continue regular plucking rounds, balanced NPK (100:50:100 kg/ha) with adequate potash, proper shade regulation (40–60%), good drainage, light pruning every year, monitor for early symptoms, prophylactic copper spray once before and after monsoon.",
  "Tea red leaf spot": "Correct phosphorus deficiency with rock phosphate or SSP, avoid water stress, spray copper oxychloride 0.25% preventively during flush periods, maintain soil pH 4.5–5.5.",
  "algal leaf in tea": "Increase sunlight penetration by reducing shade trees and pruning, improve air circulation, apply copper-based fungicide (Bordeaux mixture 1%) during high humidity, manual removal of algal mats on main stems.",
  "anthracnose in tea": "Light and frequent plucking, avoid deep skiffing during monsoon, spray tridemorph 0.1% or carbendazim + mancozeb alternately every 10–14 days in wet weather, remove infected shoots below infection point.",
  "bird eye spot in tea": "Balanced nutrition with reduced nitrogen, regular plucking, prophylactic spray of copper oxychloride 0.25% or propiconazole 0.05% during monsoon, improve field drainage.",
  "brown blight in tea": "Avoid stress (drought/poor nutrition), increase potash application, spray mancozeb 0.25% or bitertanol 0.05% during cold humid weather, prune out affected branches.",
  "healthy tea leaf": "Maintain optimum plucking table, balanced fertilization, proper shade and drainage, regular light pruning, weekly monitoring, one preventive copper spray before monsoon onset.",
  "red leaf spot in tea": "Apply single super phosphate (SSP) or DAP to correct P deficiency, foliar spray of 0.5% DAP if severe, ensure adequate moisture, avoid high pH soils."
}
