{
    "Tomato Bacterial spot": "Use certified disease-free seed or transplants, choose resistant varieties (e.g., Mountain Merit, Iron Lady), avoid overhead irrigation, stake and prune for good airflow, apply preventive copper-based sprays weekly starting at transplant, rotate crops 3–4 years, disinfect tools and stakes.",
    "Tomato Early blight": "Select resistant hybrids (e.g., Iron Lady, Mountain Magic, Defiant), mulch heavily to prevent soil splash, stake/prune lower leaves off the ground, avoid overhead watering, apply preventive fungicides (chlorothalonil, mancozeb, copper) on a 7–10 day schedule starting at first fruit set, remove lower leaves as they yellow.",
    "Tomato Late blight": "Plant resistant/tolerant varieties (e.g., Mountain Magic, Defiant, Iron Lady), space widely and prune for maximum airflow, avoid overhead irrigation, apply preventive fungicides (chlorothalonil, mancozeb) or copper weekly starting when plants are 12–18 inches tall, destroy all crop debris and volunteers, scout daily during cool wet weather.",
    "Tomato Leaf Mold": "Grow resistant varieties (e.g., Geranium, Ferline), provide excellent ventilation in greenhouses (fans, vents), space plants widely, avoid overhead watering and high humidity, apply preventive fungicides (chlorothalonil) if growing susceptible varieties in enclosed spaces.",
    "Tomato Septoria leaf spot": "Mulch plants, stake and prune to keep foliage dry, remove lower leaves touching soil, avoid overhead irrigation, apply preventive fungicides (chlorothalonil, mancozeb, copper) after first fruit set on 7–14 day schedule, clean up all debris in fall, rotate crops 2–3 years.",
    "Tomato Spider mites Two spotted spider mite": "Keep plants well-watered and avoid water stress, encourage natural predators (ladybugs, predatory mites), spray undersides of leaves with strong water jet weekly, apply preventive insecticidal soap or sulfur early if history of infestation, avoid broad-spectrum insecticides that kill beneficials.",
    "Tomato Target Spot": "Choose tolerant varieties when available, mulch and stake plants, prune for airflow, avoid overhead watering, apply preventive fungicides (mancozeb, chlorothalonil) on 7–10 day schedule starting at flowering, remove and destroy infected debris promptly.",
    "Tomato mosaic virus": "Purchase certified virus-free seed/transplants, choose resistant varieties (ToMV-resistant hybrids), disinfect tools with 10% bleach, control weeds, avoid handling plants when wet, wash hands after smoking (tobacco carries ToMV), rogue and destroy infected plants immediately.",
    "Tomato healthy": "Plant is healthy. Continue good practices: resistant varieties, proper spacing, mulching, drip irrigation, regular scouting, balanced fertilization, and crop rotation.",
    "Tomato septoria_leaf_spot": "Mulch plants, stake and prune to keep foliage dry, remove lower leaves touching soil, avoid overhead irrigation, apply preventive fungicides (chlorothalonil, mancozeb, copper) after first fruit set on 7–14 day schedule, clean up all debris in fall, rotate crops 2–3 years.",
    "Tomato yellow_leaf_curl_virus": "Plant TYLCV-resistant varieties (e.g., Tygress, Security, Shanty), use reflective mulches to repel whiteflies, apply insecticidal soap or neem oil early, install fine-mesh row covers or screens, rogue infected plants immediately, control weeds and nearby alternate hosts.",
    "tomato canker": "Use certified seed, treat seed with hot water (50°C for 25 min) if saving own seed, rotate crops 3–4 years (avoid Solanaceae), avoid wounding stems during pruning/staking, disinfect tools frequently, copper sprays early in season may reduce spread."
}